Autodesk.Revit.DB.ColumnAttachmentJustification
Control the column extent in cases where the target is not a uniform height.

Autodesk.Revit.DB.ColumnAttachmentJustification.Tangent
For slanted columns only. Extend the column until its driving curve contacts the target, then cut the column
with a plane tangent to the target at that contact point.

Autodesk.Revit.DB.ColumnAttachmentJustification.Maximum
Extend the column until it is completely covered by the target, intersecting it if necessary.

Autodesk.Revit.DB.ColumnAttachmentJustification.Midpoint
Extend the column until its midpoint contacts the target.

Autodesk.Revit.DB.ColumnAttachmentJustification.Minimum
Minimize the column extent, so that it comes in contact with the target but does not intersect.